{  "name": "Darwin REST API",  "version": "0.0.1",  "description": "Darwin REST documentation",  "apidoc": "0.2.0",  "order": [    "NRM_Core",    "Darwin_Core"  ],  "footer": {    "title": "Contribute",    "content": "<h2>Overview</h2>\n<ul>\n<li>This is a wrapper for National Rail Enquiries' Darwin API that exposes a REST API.</li>\n<li>The code is open source and is available on the <a href=\"https://github.com/HackPartners/darwinrest\">Hack Partners Github</a></li>\n<li>The API Docs for the Darwin REST API can be found at <a href=\"http://darwin.hacktrain.com\">darwin.hacktrain.com</a>.</li>\n<li>For more information about the DARWIN APIs you can visit the <a href=\"http://www.nationalrail.co.uk/46391.aspx\">National Rail Enquiries documentation</a></li>\n</ul>\n<h2>The TrainHackers (Contributors)</h2>\n<p>The HackTrain team has open sourced this project, and the active contributors to this project include:</p>\n<ul>\n<li>Alejandro Saucedo</li>\n<li>Mansimran Singh</li>\n</ul>\n<p>Big shoutout to Mr. <a href=\"https://github.com/robert-b-clarke\">Robert B. Clarke</a> for creating <a href=\"https://github.com/robert-b-clarke/nre-darwin-py\">nre-darwin-py</a> - a great python wrapper for Darwin's SOAP interface.</p>\n<h2>Motivation</h2>\n<p>Our vision is to bring innovation to the railway industry, and the first step to achieve this is making the current masses of data available in the industry, easy to access and process. For this reason the HackTrain team has decided to create this open source project to expose a standardized REST API for the Darwin API.</p>\n<h2>Code Example</h2>\n<p>The API Docs can be found at <a href=\"http://darwin.hacktrain.com\">darwin.hacktrain.com</a>. It is very simple to use this API. In order to retreive station crs codes, you only have to send:</p>\n<pre><code class=\"language-bash\">    curl -i http://darwin.hacktrain.com/api/crs\n</code></pre>\n<h2>Installation</h2>\n<p>In order to run darwinrest, you need to install the following python dependencies:</p>\n<ul>\n<li>flask</li>\n<li>flask_restful</li>\n<li>nre-darwin-py</li>\n<li>lxml cssselect</li>\n<li>beautifulsoup4</li>\n</ul>\n<p>These can be installed by running:</p>\n<pre><code class=\"language-bash\">    pip install flask flask_restful nre-darwin-py lxml cssselect beautifulsoup4\n</code></pre>\n<p>If you're running a fresh ubuntu server, make sure you have the following dependencies:</p>\n<ul>\n<li>sudo apt-get install libxml2-dev libxslt1-dev python-dev</li>\n<li>apt-get install python-lxml</li>\n</ul>\n<h2>Tests</h2>\n<p>System tests will be added as project is developed further.</p>\n<h2>Roadmap</h2>\n<p>Currently the project is in early alpha phase. We are waiting for greater support in order to develop this project further. Our future roadmap includes:</p>\n<ul>\n<li>Exposing a REST interface for all SOAP endpoints</li>\n<li>Exposing a REST interface for extra functionality</li>\n<li>Adding status of OpenLDWS API through REST</li>\n<li>Exposing a WebSockets interface for Darwin PUSH data</li>\n<li>Exploring possibility of adding REST interface to data from Darwin PUSH</li>\n</ul>\n<h2>License</h2>\n<p>This project is registered under the Apache 2.0 licence. View the LICENCE file for more details.</p>\n"  },  "sampleUrl": false,  "generator": {    "name": "apidoc",    "time": "2015-08-23T18:35:09.941Z",    "url": "http://apidocjs.com",    "version": "0.13.1"  }}